'''
题目：分析天气数据
背景：你得到了一份某城市一周的天气数据
数据以列表的形式给出
其中每个元素是一个包含日期（字符串格式）和温度（整数）的元组。
例如：weather_data = [
    ("2023-04-01", 18),
    ("2023-04-02", 20),
    ("2023-04-03", 15),
    ("2023-04-04", 12),
    ("2023-04-05", 17),
    ("2023-04-06", 22),
    ("2023-04-07", 25)
]
任务：
找出最冷的一天：
遍历天气数据，找出温度最低的一天，并打印出这一天的日期和温度。

计算平均温度：
计算这一周的平均温度，并打印出来。

找出温度上升的日子：
遍历天气数据，找出相比前一天温度有所上升的日子，并打印出这些日子的日期和温度。
假设第一天（即列表的第一个元素）之前没有数据，因此不进行比较。
'''

weather_data = [
    ("2023-04-01", 18),
    ("2023-04-02", 20),
    ("2023-04-03", 15),
    ("2023-04-04", 12),
    ("2023-04-05", 17),
    ("2023-04-06", 22),
    ("2023-04-07", 25),
    ("2023-05-09", 25)
]
days = [data[0] for data in weather_data]
temperatures = [data[1] for data in weather_data]


# 找出最冷的一天,打印
print(f'''
最冷的一天是{days[temperatures.index(min(temperatures))]}
温度为{min(temperatures)}度。
''')

# 计算平均温度,打印
print(f'平均温度为{sum(temperatures) / len(temperatures)}度。\n')
# 找出温度上升的日子,打印
for i in range(1, len(weather_data)):

    if weather_data[i][1] > weather_data[i-1][1]:
        print(f'''{weather_data[i][0]}的温度较昨天上升了{weather_data[i][1] - weather_data[i-1][1]}度.
''')
